# 모듈, 데이터 가져오기

In [45]:
import numpy as np
import pandas as pd
import sklearn
import matplotlib.pyplot as plt
import seaborn as sns
import re

from sklearn.tree import DecisionTreeClassifier

In [1]:
DATA_PATH = "../data/titanic/"

In [13]:
df = pd.read_csv(DATA_PATH+"train.csv")
SEED = 42

In [5]:
df.shape

(891, 12)

In [6]:
df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [19]:
df.columns = [col.lower() for col in df.columns]
df.columns

Index(['passengerid', 'survived', 'pclass', 'name', 'sex', 'age', 'sibsp',
       'parch', 'ticket', 'fare', 'cabin', 'embarked'],
      dtype='object')

In [9]:
df.head()

,passengerid,survived,pclass,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [20]:
target = df.pop("survived")
target

0      0
1      1
2      1
3      1
4      0
      ..
886    0
887    1
888    0
889    1
890    0
Name: survived, Length: 891, dtype: int64

In [21]:
df

,passengerid,pclass,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked
0,1,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...
886,887,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

# 수치형, 범주형 데이터 분리

In [25]:
df_numbers = df.select_dtypes(include=np.number)
df_numbers.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 6 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   passengerid  891 non-null    int64
 1   pclass       891 non-null    int64
 2   age          714 non-null    float64
 3   sibsp        891 non-null    int64
 4   parch        891 non-null    int64
 5   fare         891 non-null    float64
dtypes: float64(2), int64(4)
memory usage: 41.9 KB

In [27]:
df_objects = df.select_dtypes(include=np.object_)
df_objects.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 5 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   name      891 non-null    object
 1   sex       891 non-null    object
 2   ticket    891 non-null    object
 3   cabin     204 non-null    object
 4   embarked  889 non-null    object
dtypes: object(5)
memory usage: 34.9+ KB

In [159]:
df_numbers = df_numbers.drop(columns="passengerid")

In [28]:
df_objects.head()

,name,sex,ticket,cabin,embarked
0,"Braund, Mr. Owen Harris",male,A/5 21171,NaN,S
1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,PC 17599,C85,C
2,"Heikkinen, Miss. Laina",female,STON/O2. 3101282,NaN,S
3,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,113803,C123,S
4,"Allen, Mr. William Henry",male,373450,NaN,S

In [67]:
df_objects[["name", "sex"]][:100]

                                                 name     sex
0                             Braund, Mr. Owen Harris    male
1   Cumings, Mrs. John Bradley (Florence Briggs Th...  female
2                              Heikkinen, Miss. Laina  female
3        Futrelle, Mrs. Jacques Heath (Lily May Peel)  female
4                            Allen, Mr. William Henry    male
..                                                ...     ...
95                        Shorney, Mr. Charles Joseph    male
96                          Goldschmidt, Mr. George B    male
97                    Greenfield, Mr. William Bertram    male
98               Doling, Mrs. John T (Ada Julia Bone)  female
99                                  Kantor, Mr. Sinai    male

[100 rows x 2 columns]

In [90]:
name_header = re.compile(" [a-zA-Z]+\.")

In [94]:
nheaders = [name_header.search(x).group().strip() for x in df_objects["name"]]

In [99]:
df_objects['header'] = nheaders
df_objects

,name,sex,ticket,cabin,embarked,header
0,"Braund, Mr. Owen Harris",male,A/5 21171,NaN,S,Mr.
1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,PC 17599,C85,C,Mrs.
2,"Heikkinen, Miss. Laina",female,STON/O2. 3101282,NaN,S,Miss.
3,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,113803,C123,S,Mrs.
4,"Allen, Mr. William Henry",male,373450,NaN,S,Mr.
...,...,...,...,...,...,...
886,"Montvila, Rev. Juozas",male,211536,NaN,S,Rev.
887,"Graham, Miss. Margaret Edith",female,112053,B42,S,Miss.
888,"Johnston, Miss. Catherine Helen ""Carrie""",female,W./C. 6607,NaN,S,Miss.
889,"Behr, Mr. Karl Howell",male,111369,C148,C,Mr.
890,"Dooley, Mr. Patrick",male,370376,NaN,Q,Mr.

In [100]:
df_objects["header"].unique()

array(['Mr.', 'Mrs.', 'Miss.', 'Master.', 'Don.', 'Rev.', 'Dr.', 'Mme.',
       'Ms.', 'Major.', 'Lady.', 'Sir.', 'Mlle.', 'Col.', 'Capt.',
       'Countess.', 'Jonkheer.'], dtype=object)

skit. 앤더슨 찾기...

In [140]:
df_objects.loc[list(map(lambda x: "Andersson" in x, df_objects["name"]))]

,name,sex,ticket,cabin,embarked,header
13,"Andersson, Mr. Anders Johan",male,347082,NaN,S,Mr.
68,"Andersson, Miss. Erna Alexandra",female,3101281,NaN,S,Miss.
119,"Andersson, Miss. Ellis Anna Maria",female,347082,NaN,S,Miss.
146,"Andersson, Mr. August Edvard (""Wennerstrom"")",male,350043,NaN,S,Mr.
541,"Andersson, Miss. Ingeborg Constanzia",female,347082,NaN,S,Miss.
542,"Andersson, Miss. Sigrid Elisabeth",female,347082,NaN,S,Miss.
610,"Andersson, Mrs. Anders Johan (Alfrida Konstant...",female,347082,NaN,S,Mrs.
813,"Andersson, Miss. Ebba Iris Alfrida",female,347082,NaN,S,Miss.
850,"Andersson, Master. Sigvard Harald Elias",male,347082,NaN,S,Master.

In [145]:
name_family = re.compile(".+\,")

In [148]:
nfamily = [name_family.search(x).group().replace(",", "") for x in df_objects["name"]]

In [151]:
df_objects["family"] = nfamily
df_objects["family"].nunique()

667

In [153]:
df_name = df_objects.pop("name")
df_name

0                                Braund, Mr. Owen Harris
1      Cumings, Mrs. John Bradley (Florence Briggs Th...
2                                 Heikkinen, Miss. Laina
3           Futrelle, Mrs. Jacques Heath (Lily May Peel)
4                               Allen, Mr. William Henry
                             ...
886                                Montvila, Rev. Juozas
887                         Graham, Miss. Margaret Edith
888             Johnston, Miss. Catherine Helen "Carrie"
889                                Behr, Mr. Karl Howell
890                                  Dooley, Mr. Patrick
Name: name, Length: 891, dtype: object

In [160]:
pd.concat([df_numbers, df_objects], axis=1)

,pclass,age,sibsp,parch,fare,sex,ticket,cabin,embarked,header,family
0,3,22.0,1,0,7.2500,male,A/5 21171,NaN,S,Mr.,Braund
1,1,38.0,1,0,71.2833,female,PC 17599,C85,C,Mrs.,Cumings
2,3,26.0,0,0,7.9250,female,STON/O2. 3101282,NaN,S,Miss.,Heikkinen
3,1,35.0,1,0,53.1000,female,113803,C123,S,Mrs.,Futrelle
4,3,35.0,0,0,8.0500,male,373450,NaN,S,Mr.,Allen
...,...,...,...,...,...,...,...,...,...,...,...
886,2,27.0,0,0,13.0000,male,211536,NaN,S,Rev.,Montvila
887,1,19.0,0,0,30.0000,female,112053,B42,S,Miss.,Graham
888,3,NaN,1,2,23.4500,female,W./C. 6607,NaN,S,Miss.,Johnston
889,1,26.0,0,0,30.0000,male,111369,C148,C,Mr.,Behr
890,3,32.0,0,0,7.7500,male,370376,NaN,Q,Mr.,Dooley

### 생각 좀 해보자 해야할거 뭐있냐
- 결측치 제거
- feature 추가

# 데이터 트레인, 테스트 세트 분리

In [23]:
X_train, X_test, y_train, y_test = sklearn.model_selection.train_test_split(df, target, test_size=0.2, random_state=3)
X_train.shape, X_test.shape, y_train.shape, y_test.shape

((712, 11), (179, 11), (712,), (179,))

# 일단 모델을 돌려보자

In [17]:
dtc = DecisionTreeClassifier()

In [24]:
dtc.fit(X_train, y_train)
did_nothing_score = round(dtc.score(X_test, y_test), 4)
print(f'전처리 안한거 결과: {did_nothing_score}')

ValueError: could not convert string to float: 'Andersson, Mr. August Edvard ("Wennerstrom")'